Repository: debian-l10n-turkish/debconf
Catalog: */dbconfig-common.po
Languages: tr

source: Will this server be used to access remote databases?
tr: Bu sunucu uzak veritabanlarına erişmek için kullanılacak mı?

source: For the database types that support it, dbconfig-common includes support for configuring databases on remote systems. When installing a package's database via dbconfig-common, the questions related to remote configuration are asked with a priority such that they are skipped for most systems.
tr: dbconfig-common, eğer ilgili veritabanı türü destekliyorsa, uzak sistemlerdeki veritabanlarını yapılandırma desteği içerir. Bir paketin veritabanı dbconfig-common aracılığı ile kurulurken, uzak yapılandırmaya ilişkin sorular çoğu sistemde yanıtlamayı gerektirmeyecek şekilde sorulacaktır.

source: If you select this option, the default behavior will be to prompt you with questions related to remote database configuration when you install new packages.
tr: Eğer bu seçeneği seçerseniz, size yeni paketlerinizi kurarken uzak veritabanlarına ilişkin yapılandırmalarla ilgili soruların sorulması, öntanımlı davranış olacaktır.

source: If you are unsure, you should not select this option.
tr: Emin değilseniz, bu seçeneği seçmemelisiniz.

source: Keep "administrative" database passwords?
tr: Veritabanı yönetimsel parolaları saklansın mı?

source: By default, you will be prompted for all administrator-level database passwords when you configure, upgrade, or remove applications with dbconfig-common. These passwords will not be stored in the configuration database (debconf) for any longer than they are needed.
tr: Öntanımlı olarak, dbconfig-common ile uygulamaları yapılandırır, yükseltir ya da kaldırırken yönetici-seviyesi veritabanı parolalarını girmeniz istenecektir. Bu parolalar yapılandırma veritabanında (debconf) gerektiğinden uzun saklanmayacaktır.

source: This behavior can be disabled, in which case the passwords will remain in the database. That database is protected by Unix file permissions, though this is less secure and thus not the default setting.
tr: Bu davranış devre dışı bırakılabilir, bu durumda parolalar veritabanının içerisinde kalacaktır. Veritabanı veri dosyaları Unix dosya erişim hakları ile korunduğundan, daha az güvenilir olan bu seçenek öntanımlı değildir.

source: If you would rather not be bothered for an administrative password every time you upgrade a database application with dbconfig-common, you should choose this option. Otherwise, you should refuse this option.
tr: dbconfig-common ile yapacağınız her veritabanı uygulaması yükseltimi sırasında yönetimsel parola girmekle uğraşmak istemiyorsanız, bu seçeneği seçiniz. Aksi durumda, bu seçeneği geri çeviriniz.

source: Configure database for ${pkg} with dbconfig-common?
tr: ${pkg} paketinin veritabanı dbconfig-common ile yapılandırılsın mı?

source: The ${pkg} package must have a database installed and configured before it can be used. This can be optionally handled with dbconfig-common.
tr: ${pkg} paketi kullanılmadan önce bir veritabanı kurulmalı ve yapılandırılmalıdır. Dilerseniz bu işlem dbconfig-common tarafından yürütülebilir.

source: If you are an advanced database administrator and know that you want to perform this configuration manually, or if your database has already been installed and configured, you should refuse this option. Details on what needs to be done should most likely be provided in /usr/share/doc/${pkg}.
tr: Eğer deneyimli bir veritabanı yöneticiyseniz ve bu yapılandırmayı elle yürütmek istediğinizden eminseniz ya da veritabanı önceden yüklenmiş ve yapılandırılmış ise bu seçeneği geri çevirmelisiniz. Yapılması gerekenler ile ilgili ayrıntıları /usr/share/doc/${pkg} dizininde bulabilirsiniz.

source: Otherwise, you should probably choose this option.
tr: Aksi durumda bu seçeneği seçmeniz önerilir.

source: Reinstall database for ${pkg}?
tr: ${pkg} paketinin veritabanı yeniden kurulsun mu?

source: Since you are reconfiguring ${pkg}, you may also want to reinstall the database which it uses.
tr: ${pkg} paketini yeniden yapılandırdığınızdan, bu paketin kullanmakta olduğu veritabanını da yeniden kurmak isteyeceksinizdir.

source: If you wish to reinstall the database for ${pkg}, you should select this option. If you do not wish to do so (if you are reconfiguring the package for unrelated reasons), you should not select this option.
tr: ${pkg} paketinin veritabanını yeniden kurmak istiyorsanız bu seçeneği seçmelisiniz. Öte yandan, ${pkg} paketini veritabanı ile ilgisi olmayan nedenlerle yeniden yapılandırıyorsanız bu seçeneği geri çevirmelisiniz.

source: Perform upgrade on database for ${pkg} with dbconfig-common?
tr: ${pkg} paketinin veritabanı dbconfig-common ile yükseltilsin mi?

source: According to the maintainer for this package, database upgrade operations need to be performed on ${pkg}. Typically, this is due to changes in how a new upstream version of the package needs to store its data.
tr: Bakımcısının önerisi üzerine, ${pkg} paketi üzerinde veritabanı yükseltme işlemleri gerçekleştirilmelidir. Bu yükseltme genellikle paketin yeni sürümünün veri saklama biçimindeki değişiklikler nedeni ile gereklidir.

source: If you want to handle this process manually, you should refuse this option. Otherwise, you should choose this option. During the upgrade, a backup of the database will be made in /var/cache/dbconfig-common/backups, from which the database can be restored in the case of problems.
tr: Bu süreci elle yürütmek istiyorsanız bu seçeneği geri çevirmelisiniz. Olası sorunlarda yeniden yüklenebilmesi amacıyla veritabanının bir kopyası yükseltme sırasında /var/cache/dbconfig-common/backups dizininde yedeklenecektir.

source: Deconfigure database for ${pkg} with dbconfig-common?
tr: ${pkg} paketinin veritabanının yapılandırması dbconfig-common ile geri alınsın mı?

source: Since you are removing ${pkg}, it's possible that you no longer want the underlying database.
tr: ${pkg} paketini kaldırdığınıza göre onun veritabanına da artık gerek duymuyorsunuzdur.

source: If you like, database removal can be handled with dbconfig-common.
tr: Dilerseniz veritabanı kaldırılma işlemi dbconfig-common ile gerçekleştirilebilir.

source: If you know that you do want to keep this database, or if you want to handle the removal of this database manually, you should refuse this option.
tr: Bu veritabanını tutmayı sürdürmek ya da kaldırma işlemini elle yapmak istiyorsanız, bu seçeneği geri çevirmelisiniz.

source: Database type to be used by ${pkg}:
tr: ${pkg} paketinin kullanacağı veritabanı türü:

source: The ${pkg} package can be configured to use one of several database types. Below, you will be presented with the available choices.
tr: ${pkg} paketi aşağıda listelenen veritabanlarından herhangi biri ile çalışacak şekilde yapılandırılabilir.

source: Do you want to purge the database for ${pkg}?
tr: ${pkg} paketinin veritabanını kaldırmak istiyor musunuz?

source: If you no longer need the database for ${pkg}, you can choose to remove it now.
tr: Artık ${pkg} paketinin veritabanına gerek duymuyorsanız, şu anda onu kaldırmayı seçebilirsiniz.

source: If you no longer have need of the data being stored by ${pkg}, you should choose this option. If you want to keep this data, or if you would rather handle this process manually, you should refuse this option.
tr: ${pkg} tarafından saklanan verilere gerek duymuyorsanız, bu seçeneği seçmelisiniz. Tersine, verileri saklamak istiyor ya da bu süreci elle yürütmek istiyorsanız bu seçeneği geri çevirmelisiniz.

source: Do you want to back up the database for ${pkg} before upgrading?
tr: Yükseltme işleminden önce, ${pkg} paketinin veritabanını yedeklemek ister misiniz?

source: The underlying database for ${pkg} needs to be upgraded as part of the installation process. Just in case, the database can be backed up before this is done, so that if something goes wrong, you can revert to the previous package version and repopulate the database.
tr: Kurulum işleminin bir parçası olarak ${pkg} paketinin veritabanının güncellenmesi gerekmektedir. Ne olur ne olmaz, bu işlem yapılmadan önce şimdiki veritabanının yedeklenmesinde fayda vardır. Olur da bir şeyler ters giderse, paketin önceki sürümüne dönebilir ve veritabanını yeniden devreye alabilirsiniz.

source: Password confirmation:
tr: Parola doğrulaması:

source: Password mismatch
tr: Eşleşmeyen parola

source: The password and its confirmation do not match.
tr: Parola ve onun doğrulaması eşleşmedi.

source: abort
tr: vazgeç

source: retry
tr: yeniden dene

source: retry (skip questions)
tr: yeniden dene (soruları atla)

source: Next step for database upgrade:
tr: Veritabanı yükseltimi için sonraki adım:

source: An error occurred while upgrading the database:
tr: Veritabanı yükseltilirken bir hata oluştu:

source: Fortunately, ${dbfile} holds a backup of the database, made just before the upgrade.
tr: Neyse ki veritabanının bir yedeği yükseltme işleminden hemen önce ${dbfile} dosyasına yedeklenmiş.

source: If at this point you choose "retry", you will be prompted with all the configuration questions once more and another attempt will be made at performing the operation. "retry (skip questions)" will immediately attempt the operation again, skipping all questions. If you choose "abort", the operation will fail and you will need to downgrade, reinstall, reconfigure this package, or otherwise manually intervene to continue using it.
tr: Bu aşamada "yeniden dene" seçeneğini seçerseniz, işlemi gerçekleştirmek için yeni bir girişimde bulunulacak ve sizden bir kez daha tüm yapılandırma sorularını yanıtlamanız istenecektir. "yeniden dene (soruları atla)" seçeneği ise, yeni bir girişimde bulunacak fakat soru sormayacaktır. "vazgeç" seçeneği işlemi başarısız kılacak ve sizin bu paketi kullanmadan önce önceki sürümüne almanız, yeniden kurmanız, yeniden yapılandırmanız ya da elle düzeltmeniz gerekecektir.

source: ignore
tr: gözardı et

source: Next step for database installation:
tr: Veritabanı kurulumu için sonraki adım:

source: An error occurred while installing the database:
tr: Veritabanı kurulurken bir hata oluştu:

source: If at this point you choose "retry", you will be prompted with all the configuration questions once more and another attempt will be made at performing the operation. "retry (skip questions)" will immediately attempt the operation again, skipping all questions. If you choose "abort", the operation will fail and you will need to downgrade, reinstall, reconfigure this package, or otherwise manually intervene to continue using it. If you choose "ignore", the operation will continue, ignoring further errors from dbconfig-common.
tr: Bu aşamada "yeniden dene" seçeneğini seçerseniz, işlemi gerçekleştirmek için yeni bir girişimde bulunulacak ve sizden bir kez daha tüm yapılandırma sorularını yanıtlamanız istenecektir. "yeniden dene (soruları atla)" seçeneği ise, yeni bir girişimde bulunacak fakat soru sormayacaktır. "vazgeç" seçeneği işlemi başarısız kılacak ve sizin paketi kullanmadan önce önceki sürümüne almanız, yeniden kurmanız, yeniden yapılandırmanız ya da elle düzeltmeniz gerekecektir. Eğer "gözardı et" seçeneğini seçerseniz, işlem dbconfig-common'dan gelecek hatalara bakılmaksızın sürecektir.

source: Next step for database removal:
tr: Veritabanı kaldırma için sonraki adım:

source: An error occurred while removing the database:
tr: Veritabanı kaldırılırken bir hata oluştu:

source: For some reason it was not possible to perform some of the actions necessary to remove the database for ${pkg}. At this point you have two options: you can find out what has caused this error and fix it, or you can refuse the offer for help removing the database (the latter implies you will have to remove the database manually).
tr: ${pkg} paketinin veritabanını kaldırmak için gerekli bazı eylemler bir şekilde yerine getirilemedi. Bu aşamada iki seçeneğiniz var: hatanın nedenini bulur ve giderirsiniz ya da veritanabını kaldırma önerisini geri çevirirsiniz (ki bu ikinci seçenekte veritabanını elle kaldırmanız gerekecektir).

source: Next step:
tr: Sonraki adım:

source: Configuring the database for ${pkg} requires the package ${dbpackage} to be installed and configured first, which is not something that can be checked for automatically.
tr: ${pkg} paketinin veritabanını yapılandırma işlemi ${dbpackage} paketinin kurulmuş ve yapılandırılmış olmasına bağlıdır, ki bu durum kendiliğinden denetlenemez.

source: If in doubt, you should choose "abort", and install ${dbpackage} before continuing with the configuration of this package. If you choose "retry", you will be allowed to choose different answers (in case you chose the wrong database type by mistake). If you choose "ignore", then installation will continue as normal.
tr: Şüpheye düştüğünüzde "vazgeç" seçeneğini seçmeli, ${dbpackage} veritabanı paketini yüklemeli ve daha sonra bu paketin yapılandırmasını sürdürmelisiniz. "yeniden dene" seçeneğini seçerseniz yapılandırma ile ilgili başka seçenekleri değerlendirebileceksiniz. Eğer "gözardı et" seçeneğini seçerseniz, kurulum olması gerektiği gibi sürecektir.

source: Host name of the ${dbvendor} database server for ${pkg}:
tr: ${pkg} paketinin ${dbvendor} veritabanı sunucusu için makine adı:

source: Please select the remote hostname to use, or select "new host" to enter a new host.
tr: Lütfen bir uzak sunucu makine adı seçin ya da "yeni makine" seçeneği ile yeni bir makine girin.

source: Port number for the ${dbvendor} service:
tr: ${dbvendor} veritabanı hizmetinin kullanacağı port numarası:

source: Please specify the port the ${dbvendor} database on the remote host is running on. To use the default port, leave this field blank.
tr: Uzak makinede çalışan ${dbvendor} veritabanının port numarasını belirtiniz. Öntanımlı port için bu alanı boş bırakınız.

source: Host running the ${dbvendor} server for ${pkg}:
tr: ${pkg} paketinin ${dbvendor} hizmetini veren makine:

source: Please provide the hostname of a remote ${dbvendor} server.
tr: Bir uzak ${dbvendor} sunucusunun makine adını giriniz.

source: You must have already arranged for the administrative account to be able to remotely create databases and grant privileges.
tr: Yönetimsel hesaba uzaktan veritabanı yaratma ve haklarını devretme yetkisini vermiş olmanız gerekiyor.

source: ${dbvendor} database name for ${pkg}:
tr: ${pkg} paketi için ${dbvendor} veritabanı adı:

source: Please provide a name for the ${dbvendor} database to be used by ${pkg}.
tr: ${pkg} paketinin kullanacağı ${dbvendor} veritabanı için bir ad giriniz.

source: ${dbvendor} username for ${pkg}:
tr: ${pkg} paketi için ${dbvendor} kullanıcı adı:

source: Please provide a ${dbvendor} username for ${pkg} to register with the database server. A ${dbvendor} user is not necessarily the same as a system login, especially if the database is on a remote server.
tr: ${pkg} paketinin veritabanı sunucusuna kaydı için bir ${dbvendor} kullanıcı adı giriniz. Özellikle uzak sunuculardaki veritabanları için olmak üzere, bir ${dbvendor} kullanıcı adının sistem kullanıcı adı ile aynı olmasına gerek yoktur.

source: This is the user which will own the database, tables and other objects to be created by this installation. This user will have complete freedom to insert, change or delete data in the database.
tr: Bu kullanıcı bu kurulum ile yaratılacak veritabanı, tablolar ve diğer nesnelerin sahibi olacak ve böylece veritabanına dilediğince veri ekleyebilecek, değiştirebilecek ya da silebilecektir.

source: ${dbvendor} storage directory for ${pkg}:
tr: ${pkg} paketinin ${dbvendor} saklama dizini:

source: Please provide a path where the ${dbvendor} database file for ${pkg} should be installed into.
tr: ${pkg} paketi için kurulacak ${dbvendor} veritabanının saklanacağı dizini giriniz.

source: The permissions for this directory will be set to match the permissions for the generated database file.
tr: Bu dizinin erişim hakları oluşturulacak veritabanı dosyası ile eşleşecek şekilde ayarlanacaktır.

source: unix socket
tr: unix soketi

source: Connection method for MySQL database of ${pkg}:
tr: ${pkg} paketinin MySQL veritabanına bağlanma yöntemi:

source: By default, ${pkg} will be configured to use a MySQL server through a local unix socket (this provides the best performance). However, if you would like to connect with a different method, or to a different server entirely, select an option from the choices below.
tr: Öntanımlı olarak ${pkg} paketi MySQL sunucusuna yerel bir unix soketi üzerinden bağlanacak şekilde yapılandırılacaktır (bu en iyi başarımı sağlayacaktır). Bununla birlikte, başka bir yöntemle bağlanmak ya da hepten başka bir sunucuya bağlanmak isterseniz, aşağıdaki seçeneklerden birini seçiniz.

source: MySQL application password for ${pkg}:
tr: ${pkg} paketi için MySQL uygulama parolası:

source: Please provide a password for ${pkg} to register with the database server. If left blank, a random password will be generated.
tr: ${pkg} paketini veritabanı sunucusuna bağlamak için bir parola giriniz. Bu alanı boş bırakırsanız, rastgele bir parola üretilecektir.

source: Name of the database's administrative user:
tr: Veritabanı yönetimsel kullanıcısının adı:

source: Please provide the name of the account with which this package should perform administrative actions. This user is the one which is able to create new database users.
tr: Bu paketin yönetimsel işlemlerini gerçekleştirmek için kullanacağı hesabın kullanıcı adını giriniz. Bu hesabın sahibi yeni veritabanı kullanıcıları yaratabilecektir.

source: For MySQL, this is almost always "root". Note that this is NOT the same as the UNIX login "root".
tr: MySQL için bu ad her durumda "root" olmalıdır ve bu UNIX kullanıcısı olan "root" değildir.

source: Password of the database's administrative user:
tr: Veritabanı yönetimsel kullanıcısının parolası:

source: Please provide the password for the administrative account with which this package should create its MySQL database and user.
tr: Bu paketin kendi MySQL veritabanını ve kullanıcısını yaratmak için kullanacağı yönetimsel kullanıcının parolasını giriniz.

source: Connection method for PostgreSQL database of ${pkg}:
tr: ${pkg} paketinin PostgreSQL veritabanına bağlanma yöntemi:

source: By default, ${pkg} will be configured to use a PostgreSQL server through a local unix socket (this provides the best performance). However, if you would like to connect with a different method, or to a different server entirely, select an option from the choices below.
tr: Öntanımlı olarak ${pkg} paketi PostgreSQL sunucusuna yerel bir unix soketi üzerinden bağlanacak şekilde yapılandırılacaktır (bu en iyi başarımı sağlayacaktır). Bununla birlikte, başka bir yöntemle bağlanmak ya da hepten başka bir sunucuya bağlanmak isterseniz, aşağıdaki seçeneklerden birini seçiniz.

source: PostgreSQL application password for ${pkg}:
tr: ${pkg} paketi için PostgreSQL uygulama parolası:

source: If you are using "ident" based authentication, the supplied password will not be used and can be left blank. Otherwise, PostgreSQL access may need to be reconfigured to allow password-authenticated access.
tr: Eğer "kimlik" tabanlı yetkilendirme kullanıyorsanız girilen parola kulanılmayacağından boş bırakılabilir. Aksi durumda PostgreSQL erişimi parola tabanlı erişime olanak tanıyacak şekilde yeniden yapılandırılmalıdır.

source: Password of your database's administrative user:
tr: Veritabanınızın yönetimsel kullanıcısının parolası:

source: Please provide the password for the account with which this package should perform administrative actions.
tr: Bu paketin yönetimsel işlemleri gerçekleştirmek için kullanacağı hesabın parolasını giriniz.

source: For a standard PostgreSQL package installation, a database password is not required, since authentication is done at the system level.
tr: Sıradan bir PostgreSQL kurulumunda yetkilendirme sistem seviyesinde yapıldığı için bir veritabanı parolasına gerek duyulmaz.

source: ident
tr: kimlik

source: password
tr: parola

source: Method for authenticating the PostgreSQL administrator:
tr: PostgreSQL yöneticisi için yetkilendirme yöntemi:

source: PostgreSQL servers provide several different mechanisms for authenticating connections. Please select what method the administrative user should use when connecting to the server.
tr: PostgreSQL sunucuları bağlantıları yetkilendirmek için çeşitli yöntemler sağlarlar. Yönetimsel kullanıcının sunucuya bağlanırken kullanacağı yöntemi seçiniz.

source: With "ident" authentication on the local machine, the server will check that the owner of the unix socket is allowed to connect.
tr: Yerel makinede "kimlik" ile yetkilendirmede, sunucu unix soketinin sahibinin bağlanma izni olup olmadığını denetler.

source: With "ident" authentication to remote hosts, RFC 1413 based ident is used (note this can be considered a security risk).
tr: Uzak makinelerde "kimlik" yetkilendirmede RFC 1413 tabanlı tanıtım kullanılır (bu bir güvenlik açığı sayılabilir).

source: With "password" authentication, a password will be passed to the server for use with some authentication backend (such as "md5" or "pam"). Note that the password is still passed in the clear across network connections if your connection is not configured to use SSL.
tr: "parola" türü yetkilendirmede, bir parola, yetkilendirme arka ucu ("md5 ya da "pam" gibi) tarafından değerlendirilmek üzere sunucuya gönderilir. Eğer bağlantılarınız SSL türü katman kullanmıyorsa, parolaların ağ üzerinden açık dizeler olarak aktarıldığını unutmayın.

source: For a standard PostgreSQL package installation running on the same host, "ident" is recommended.
tr: PostgreSQL sunucu ile aynı makineye yapılacak olağan kurulumlarda "kimlik" türü yetkilendirme önerilir.

source: Method for authenticating PostgreSQL user:
tr: PostgreSQL kullanıcısı için yetkilendirme yöntemi:

source: PostgreSQL servers provide several different mechanisms for authenticating connections. Please select what method the database user should use when connecting to the server.
tr: PostgreSQL sunucuları bağlantıları yetkilendirmek için çeşitli yöntemler sağlarlar. Veritabanı kullanıcısının sunucuya bağlanırken kullanacağı yöntemi seçiniz.

source: PostgreSQL connection method error
tr: PostgreSQL bağlantı yöntemi hatası

source: Unfortunately, it seems that the database connection method you have selected for ${pkg} will not work, because it requires the existence of a local user that does not exist.
tr: Şu anda varolmayan bir yerel kullanıcının varlığını gerektirdiğinden, ne yazık ki ${pkg} paketi için seçmiş olduğunuz bağlantı yöntemi çalışmayacak gibi görünüyor.

source: Change PostgreSQL configuration automatically?
tr: PostgreSQL yapılandırması kendiliğinden değiştirilsin mi?

source: It has been determined that the database installation for ${pkg} can not be automatically accomplished without making changes to the PostgreSQL server's access controls. It is suggested that this be done by dbconfig-common when the package is installed. If instead you would prefer it done manually, the following line needs to be added to your pg_hba.conf:
tr: ${pkg} paketi için veritabanı kurulumunun PostgreSQL sunucusunun erişim denetimi değiştirilmeden tamamlanmayacağı belirlendi. Bu değişikliğin paket kurulurken dbconfig-common tarafından yapılması önerilir. Bunun yerine değişikliği elle yapmak isterseniz, aşağıdaki satırı pg_hba dosyasına eklemeniz gerekir:

source: Revert PostgreSQL configuration automatically?
tr: PostgreSQL yapılandırması kendiliğinden eski şekline getirilsin mi?
