Repository: debian-l10n-turkish/debconf
Catalog: */dbconfig-common.po
Languages: tr

source: As ${pkg} is now being removed, it may no longer be necessary to have an access control entry in the PostgreSQL server's configuration. While keeping such an entry will not break any software on the system, it may be seen as a potential security concern. It is suggested that this be done by dbconfig-common when the package is removed. If instead you would prefer it done manually, the following line needs to be removed from your pg_hba.conf:
tr: ${pkg} paketi kaldırılmakta olduğundan PostgreSQL sunucusunun yapılandırmasında erişim denetim içeriği tutmasına gerek kalmamıştır. İlgili içeriğin yapılandırmada kalması herhangi bir yazılımın başarımını engellemese de bir güvenlik açığı olarak değerlendirilmelidir. Bu içeriğin paket kaldırılırken dbconfig-common tarafından temizlenmesi önerilir. Bunun yerine değişikliği elle yapmak isterseniz, aşağıdaki satırı pg_hba dosyasından çıkarmanız gerekir:

source: Modifications needed in /etc/postgresql/pg_hba.conf
tr: /etc/postgresql/pg_hba.conf dosyasında yapılması gereken değişiklikler

source: To get the database for package ${pkg} bootstrapped you have to edit the configuration of the PostgreSQL server. You may be able to find help in the file /usr/share/doc/${pkg}/README.Debian.
tr: ${pkg} paketine ait veritabanının paket çalışmaya başlamadan önce veri girişine hazır olması için PostgreSQL sunucu yapılandırmasını düzenlemelisiniz. /usr/share/doc/${pkg}/README.Debian dosyasından yardım alabilirsiniz.

source: Empty passwords unsupported with PostgreSQL
tr: PostgreSQL boş parolaları desteklemez
