Repository: debian-l10n-turkish/debconf
Catalog: */debian-edu-install.po
Languages: tr

source: Choose Debian Edu profile
tr: Debian Edu profilini seçin

source: Main Server
tr: Ana Sunucu

source: Workstation
tr: İş-istasyonu

source: Roaming Workstation
tr: Gezici İş İstasyonu

source: Thin Client Server
tr: Hafif İstemci Sunucusu

source: Standalone
tr: Kendibaşına

source: Minimal
tr: Asgari

source: Profile(s) to apply to this machine:
tr: Bu makineye uygulanacak profil(ler):

source: Profiles determine how the machine can be used out-of-the-box:
tr: Kurulum tamamlandığında makinenin nasıl kullanılacağını belirleyen profiller:

source: - Main Server: reserved for the Debian Edu server. It does not include any GUI (Graphical User Interface). There should only be one such server on a Debian Edu network. - Workstation: for normal machines on the Debian Edu network. - Roaming Workstation: for single user machines on the Debian Edu network which some times travel outside the network. - Thin Client Server: includes 'Workstation' and requires two network cards. - Standalone: for machines meant to be used outside the Debian Edu network. It includes a GUI and conflicts with other profiles. - Minimal: fully integrated into the Debian Edu network but contains only a basic system without any GUI.
tr: - Ana Sunucu: Debian Edu sunucusuna mahsustur. Herhangi bir GUI (Grafik Kullanıcı Arabirimi) içermez. Bir Debian Edu ağında yalnızca bir adet Ana-sunucu olmalıdır. - İş istasyonu: Debian Edu ağındaki normal makineler içindir. - Roaming Workstation: for single user machines on the Debian Edu network which some times travel outside the network. - Hafif İstemci Sunucusu: 'İş istasyonu'nu kapsar ve iki ağ kartı gerektirir. - Kendibaşına: Debian Edu ağının dışında kullanılacak makineler içindir. GUI içerir ve diğer profillerle çakışır. - Asgari: Debian Edu ağıyla bütünleşiktir ama GUI içermez; sadece temel bir sistem içerir.

source: Standalone profile cannot be used with other profiles
tr: Kendibaşına profili diğer profillerle kullanılamaz

source: The Standalone profile cannot be installed together with any other profile on the same machine. Please either only choose Standalone or any other combination excluding Standalone.
tr: Kendibaşına profili aynı makineye diğer profillerle birlikte kurulamaz. Lütfen ya sadece Kendibaşına'yı; ya da Kendibaşına'yı içermeyen diğer bileşimleri seçin.

source: Standalone installation is partly manual
tr: Kendibaşına kurulumu kısmen elle yürütülür

source: The Standalone install is currently not as automatic as the other profiles, to make it easier to do manual partitioning. You are now sent to the debian-installer main menu. Select "Change debconf priority", and choose priority "high" to enable the automatic installation again.
tr: Kendibaşına kurulumu, elle bölümlemeyi kolaylaştıracak şekilde hâlihazırda diğer profiller kadar otomatikleştirilmemiştir. Şimdi Debian kurulum programının ana menüsüne gireceksiniz. Otomatik kurulumu yeniden etkin kılmak için "Debconf önceliğini değiştir" menüsünden "yüksek" önceliği seçin.

source: Really use the automatic partitioning tool?
tr: Otomatik bölümleme aracını kullanmak istediğinizden emin misiniz?

source: This will destroy the partition table on all disks in the machine. REPEAT: THIS WILL WIPE CLEAN ALL HARD DISKS IN THE MACHINE! If you have important data that are not backed up, you may want to stop now in order to do a backup. In that case, you'll have to restart the installation later.
tr: Bu işlem makinede bulunan tüm disklerin bölümleme tablosunu yok edecektir. TEKRAR EDİYORUM: BU İŞLEM MAKİNEDE BULUNAN TÜM SABİT DİSKLERDEKİ VERİLERİ SİLECEKTİR! Eğer yedeklenmemiş önemli verileriniz varsa işlemi şimdi durdurup yedekleme yapmak isteyebilirsiniz. Böyle bir durumda kurulumu daha sonra tekrar başlatmalısınız.

source: Participate in the package usage survey?
tr: Paket kullanım anketine katılmak ister misiniz?

source: The system may anonymously supply the distribution developers with statistics about the most used packages on this system. This information influences decisions such as which packages should go on the first distribution CD.
tr: Bu sistemde en çok kullanılan paketler hakkındaki istatistiksel bilgiler isimsiz (anonim) şekilde dağıtım geliştiricilerine iletilebilir. Bu bilgiler, dağıtımın birinci CD'si içinde olması gereken paketlerin belirlenmesi gibi bazı kararlar üzerinde etkili olacaktır.

source: If you choose to participate, the automatic submission script will run once every week, sending statistics to the distribution developers. The collected statistics can be viewed on http://popcon.debian.org/.
tr: Katılmak isterseniz otomatik gönderim betiği haftada bir kez çalışacak ve toplanan istatistikleri dağıtım geliştiricilerine gönderecektir. Bu istatistiklere http://popcon.debian.org/ adresinden erişilebilir.

source: This choice can be later modified by running "dpkg-reconfigure popularity-contest".
tr: Burada yapılan seçim daha sonra, "dpkg-reconfigure popularity-contest" komutu çalıştırılarak değiştirilebilir.

source: Debian Edu Main Server
tr: Debian Edu Ana Sunucu

source: Debian Edu Thin Client Server
tr: Debian Edu Hafif İstemci Sunucusu

source: Debian Edu Workstation
tr: Debian Edu İş-istasyonu

source: Debian Edu Main Server and Thin Client Server
tr: Debian Edu Ana Sunucu ve Hafif İstemci Sunucusu

source: Debian Edu Main Server and Workstation
tr: Debian Edu Ana Sunucu ve İş İstasyonu

source: Debian Edu Minimal
tr: Debian Edu Asgari

source: Debian Edu package installation failed
tr: Debian Edu paket kurulumu başarısız oldu

source: Installation of required packages failed
tr: Gerekli paketler kurulamadı

source: Some required packages failed to install. The packages were ${PACKAGES}. Check /var/log/syslog if there is some information why this happened. The installed system is not going to work properly, so the installation was aborted and the system will be rebooted now.
tr: Gerekli paketlerden bazıları kurulamadı. Kurulamayan paketler: ${PACKAGES}. Bunun sebebini öğrenmek için /var/log/syslog dosyasına göz atın. Kurulan sistem düzgün çalışmayacak, bu nedenle kurulum iptal edildi ve şimdi sistem yeniden başlatılacak.

source: Available disk space is too small. Abort the installation?
tr: Yeteri kadar boş disk alanı yok. Kurulum iptal edilsin mi?

source: The available disk space is too small for the selected profiles. Please choose whether you want to abort the installation or continue without setting up the recommended partitioning setup
tr: Boş disk alanı seçilen profiller için yetersiz. Lütfen ya kurulumu iptal edin ya da kurulum işlemine önerilen bölümleme şeklini kullanmadan devam edin.

source: If you choose to continue, one single partition will be used for all system files _and_ user files. Note that this can cause stability problems after a while.
tr: Devam etmeyi seçerseniz tüm sistem _ve_ kullanıcı dosyaları için tek bir bölüm kullanılacaktır. Bu seçimin bir süre sonra kararlılık sorunlarına yol açabileceğini göz önünde bulundurun.

source: Install Debian Edu profile (enforce menu order)
tr: Debian Edu profilini kur (menü sırasını takip et)

source: Some errors were found during installation
tr: Kurulum sırasında bazı sorunlarla karşılaşıldı:

source: Consider reporting them to the Debian Edu developers.
tr: Bu sorunları Debian Edu geliştiricilerine bildirmeyi düşünün.
