Repository: debian-l10n-turkish/debconf
Catalog: */shorewall.po
Languages: tr

source: No automatic restart for Shorewall
tr: Shorewall kendiliğinden başlamayacak

source: Shorewall will not be restarted automatically after being upgraded, to prevent changes in configuration files causing network outages.
tr: Yapılandırma dosyalarındaki değişikliklerin ağ iletişimi kaybına neden olmaması için Shorewall yükseltme sonrasında yeniden başlatılmayacak.

source: You should check Shorewall's configuration files and restart it with 'invoke-rc.d shorewall restart'.
tr: Shorewall'un yapılandırma dosyalarını incelemeli ve 'invoke-rc.d shorewall restart' komutunu çalıştırarak yeniden başlatmalısınız.

source: Restart Shorewall?
tr: Shorewall yeniden başlatılsın mı?

source: This release of Shorewall introduces some changes in the configuration files - see /usr/share/doc/shorewall/releasenotes.txt.gz.
tr: Shorewall'un bu sürümü yapılandırma dosyalarına değişiklikler getirmiştir, ayrıntılı bilgi için /usr/share/doc/shorewall/releasenotes.txt.gz dosyasını inceleyiniz.

source: To avoid the risk of failures and network outages these files should be checked carefully before the firewall is restarted.
tr: Olası başarısızlıklardan ve ağ iletişimi kaybından kaçınmak için güvenlik duvarı yeniden başlatılmadan önce bu dosyalar dikkatle incelenmelidir.

source: Please choose whether you want to restart Shorewall immediately.
tr: Shorewall'u şimdi yeniden başlatmak isteyip istemediğinizi belirtiniz.

source: Invalid Shorewall configuration detected
tr: Geçersiz Shorewall yapılandırması algılandı

source: Shorewall is configured to restart on upgrades.
tr: Shorewall yükseltmeler sonrasında yeniden başlayacak şekilde yapılandırıldı.

source: However, the current configuration for Shorewall is invalid and it will fail to restart. You should fix the program's configuration, then restart it with 'invoke-rc.d shorewall restart'.
tr: Oysa Shorewall'un şu anki yapılandırması geçersiz ve bu nedenle yeniden başlayamayacak. Programın yapılandırmasını düzenleyip 'invoke-rc.d shorewall restart' komutunu çalıştırarak yeniden başlatmalısınız.
